entidad_de_salud/app/Models/Home/Model_home.php

	public function getUsuarios(){
		$data = array();
		$builder = $this->db->table('Usuarios');
		$query = $builder->select('ID,NOMBRE,APELLIDO,NUMERO_TELEFONO,DEPARTAMENTO,MUNICIPIO,DIRECCION,TIPO_DE_PERFIL,USUARIO,CONTRASEÑA')->get();
---
SELECT `ID`, `NOMBRE`, `APELLIDO`, `NUMERO_TELEFONO`, `DEPARTAMENTO`, `MUNICIPIO`, `DIRECCION`, `TIPO_DE_PERFIL`, `USUARIO`, `CONTRASEÑA`
FROM `Usuarios`

    public function getDepartamentos(){
		$data = array();
		$builder = $this->db->table('Departamentos');
		$query = $builder->select('ID,NOMBRE')->get();
---
SELECT `ID`, `NOMBRE`
FROM `Departamentos`

    public function getMunicipios($id_depa){
		$data = array();
		$builder = $this->db->table('Municipios');
		$builder->select('ID,NOMBRE,DEPARTAMENTO');
        $builder->where('DEPARTAMENTO',$id_depa);
		$query = $builder->get();
---
SELECT `ID`, `NOMBRE`, `DEPARTAMENTO`
FROM `Municipios`
WHERE `DEPARTAMENTO` = '2'

    public function getConsultorios($id_medico = NULL){
		$data = array();
		$builder = $this->db->table('CONSULTORIOS');
		$builder->select('CONSULTORIOS.ID,CONSULTORIOS.DEPARTAMENTO,CONSULTORIOS.MUNICIPIO,CONSULTORIOS.DIRECCION');


		if(isset($id_medico)){
			$builder->join('CITAS_MEDICAS','CONSULTORIOS.ID = CITAS_MEDICAS.CONSULTORIO');
			$builder->join('USUARIOS', 'CITAS_MEDICAS.MEDICO = USUARIOS.ID');
			$builder->where('USUARIOS.ID', $id_medico);
			$builder->groupBy('CONSULTORIOS.ID');
		}
		$query = $builder->get();
---
SELECT `CONSULTORIOS`.`ID`, `CONSULTORIOS`.`DEPARTAMENTO`, `CONSULTORIOS`.`MUNICIPIO`, `CONSULTORIOS`.`DIRECCION`
FROM `CONSULTORIOS`
JOIN `CITAS_MEDICAS` ON `CONSULTORIOS`.`ID` = `CITAS_MEDICAS`.`CONSULTORIO`
JOIN `USUARIOS` ON `CITAS_MEDICAS`.`MEDICO` = `USUARIOS`.`ID`
WHERE `USUARIOS`.`ID` = '2'
GROUP BY `CONSULTORIOS`.`ID`

    public function getCitas( $fecha = NULL, $consultorio = NULL, $id_medico = NULL, $id_cita = NULL, $id_usuario = NULL){
        $data = array();
		$builder = $this->db->table('citas_medicas');
		$builder->select('ID,FECHA,MEDICO,USUARIO,COMPLETADA,CONSULTORIO,TIPO_CONSULTA');

		if(isset($id_cita)){
            $builder->where('ID ',$id_cita);
        }

        if(isset($fecha)){
            $builder->where('FECHA >=',$fecha);
        }

        if(isset($consultorio)){
            $builder->where('CONSULTORIO',$consultorio);
        }

		if(isset($id_medico)){
			$builder->where('MEDICO',$id_medico);
		}

		if(isset($id_usuario)){
			$builder->where('usuario',$id_usuario);
		}

        $query = $builder->get();
---
SELECT `ID`, `FECHA`, `MEDICO`, `USUARIO`, `COMPLETADA`, `CONSULTORIO`, `TIPO_CONSULTA`
FROM `citas_medicas`
WHERE `MEDICO` = '2'

	public function getReportesMedicos($id_usuario = NULL){
        $data = array();
		$builder = $this->db->table('Reportes_Medicos');
		$builder->select('ID,DIAGNOSTICO,USUARIO,MEDICO,FECHA');

		if(isset($id_usuario)){
			$builder->where('USUARIO',$id_usuario);
		}

        $query = $builder->get();
---
SELECT `ID`, `DIAGNOSTICO`, `USUARIO`, `MEDICO`, `FECHA`
FROM `Reportes_Medicos`

	public function getMedicamentos(){
        $data = array();
		$builder = $this->db->table('Medicamentos');
		$builder->select('ID,NOMBRE');

        $query = $builder->get();
---
SELECT `ID`, `NOMBRE`
FROM `Medicamentos`