entidad_de_salud/app/Models/Home/Model_home.php

    public function getCitas( $fecha = NULL, $consultorio = NULL){
        $data = array();
		$builder = $this->db->table('citas_medicas');
		$builder->select('ID,FECHA,MEDICO,USUARIO,COMPLETADA,CONSULTORIO,TIPO_CONSULTA');

        if(isset($fecha)){
            $builder->where('FECHA >=',$fecha);
        }

        if(isset($consultorio)){
            $builder->where('CONSULTORIO',$consultorio);
        }

        $query = $builder->get();
---
SELECT `ID`, `FECHA`, `MEDICO`, `USUARIO`, `COMPLETADA`, `CONSULTORIO`, `TIPO_CONSULTA`
FROM `citas_medicas`
WHERE `FECHA` >= '2022-08-16 12:00:00'
AND `CONSULTORIO` = '1'